In [1]:
import pandas as pd

In [2]:
df =pd.DataFrame()
df.head()

Empty DataFrame
Columns: []
Index: []

In [6]:
#Using dict

data = {'Name': ['Shubham', 'Apeksha', 'Manthan', 'Rupal'], 'Age': [20, 45, 46, 52]}
df = pd.DataFrame(data)
df.head()

      Name  Age
0  Shubham   20
1  Apeksha   45
2  Manthan   46
3    Rupal   52

In [7]:
# Using list of dicts

data = [{'Name': 'Shubham', 'Age': 20}, {'Name': 'Apeksha', 'Age': 45}, {'Name': 'Manthan', 'Age': 46}]
df = pd.DataFrame(data)
df.head()

      Name  Age
0  Shubham   20
1  Apeksha   45
2  Manthan   46

In [8]:
# Using tuples

data = [('Shubham', 20), ('Apeksha', 45), ('Manthan', 46)]
df = pd.DataFrame(data, columns=['Name', 'Age'])
df.head()

      Name  Age
0  Shubham   20
1  Apeksha   45
2  Manthan   46

In [9]:
# Using dictionary

dict1 = {0: 'Shubham', 1: 'Apeksha', 2: 'Manthan'}
series = pd.Series(dict1)
series

0    Shubham
1    Apeksha
2    Manthan
dtype: object

In [10]:
# Using numpy arrays

import numpy as np
arr = np.array([12,13,67,35])
series = pd.Series(arr)
series

0    12
1    13
2    67
3    35
dtype: int32

In [11]:
series = pd.Series(10, index=[0,1,2,3,4,5,6,7])
series

0    10
1    10
2    10
3    10
4    10
5    10
6    10
7    10
dtype: int64

In [12]:
df = pd.read_csv('WHO_first9cols.csv')
df.head()

,Country,CountryID,Continent,Adolescent fertility rate (%),Adult literacy rate (%),Gross national income per capita (PPP international $),Net primary school enrolment ratio female (%),Net primary school enrolment ratio male (%),Population (in thousands) total
0,Afghanistan,1,1,151.0,28.0,NaN,NaN,NaN,26088.0
1,Albania,2,2,27.0,98.7,6000.0,93.0,94.0,3172.0
2,Algeria,3,3,6.0,69.9,5940.0,94.0,96.0,33351.0
3,Andorra,4,2,NaN,NaN,NaN,83.0,83.0,74.0
4,Angola,5,3,146.0,67.4,3890.0,49.0,51.0,16557.0

In [13]:
country_series = df['Country']
type(country_series)

pandas.core.series.Series

In [14]:
df.shape

(202, 9)

In [15]:
df.columns

Index(['Country', 'CountryID', 'Continent', 'Adolescent fertility rate (%)',
       'Adult literacy rate (%)',
       'Gross national income per capita (PPP international $)',
       'Net primary school enrolment ratio female (%)',
       'Net primary school enrolment ratio male (%)',
       'Population (in thousands) total'],
      dtype='object')

In [16]:
df.dtypes

Country                                                    object
CountryID                                                   int64
Continent                                                   int64
Adolescent fertility rate (%)                             float64
Adult literacy rate (%)                                   float64
Gross national income per capita (PPP international $)    float64
Net primary school enrolment ratio female (%)             float64
Net primary school enrolment ratio male (%)               float64
Population (in thousands) total                           float64
dtype: object

In [17]:
country_series[-5:]

197               Vietnam
198    West Bank and Gaza
199                 Yemen
200                Zambia
201              Zimbabwe
Name: Country, dtype: object

In [19]:
#!pip install Quandl

Collecting Quandl
  Downloading Quandl-3.6.1-py2.py3-none-any.whl (26 kB)
Requirement already satisfied: numpy>=1.8 in e:\installations\lib\site-packages (from Quandl) (1.18.5)
Requirement already satisfied: pandas>=0.14 in e:\installations\lib\site-packages (from Quandl) (1.0.5)
Requirement already satisfied: six in e:\installations\lib\site-packages (from Quandl) (1.15.0)
Collecting inflection>=0.3.1
  Downloading inflection-0.5.1-py2.py3-none-any.whl (9.5 kB)
Requirement already satisfied: python-dateutil in e:\installations\lib\site-packages (from Quandl) (2.8.1)
Requirement already satisfied: more-itertools in e:\installations\lib\site-packages (from Quandl) (8.4.0)
Requirement already satisfied: requests>=2.7.0 in e:\installations\lib\site-packages (from Quandl) (2.24.0)
Requirement already satisfied: pytz>=2017.2 in e:\installations\lib\site-packages (from pandas>=0.14->Quandl) (2020.1)
Requirement already satisfied: idna<3,>=2.5 in e:\installations\lib\site-packages (from requests>=2.7.0->Quandl) (2.10)
Requirement already satisfied: chardet<4,>=3.0.2 in e:\installations\lib\site-packages (from requests>=2.7.0->Quandl) (3.0.4)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in e:\installations\lib\site-packages (from requests>=2.7.0->Quandl) (1.25.9)
Requirement already satisfied: certifi>=2017.4.17 in e:\installations\lib\site-packages (from requests>=2.7.0->Quandl) (2020.6.20)
Installing collected packages: inflection, Quandl
Successfully installed Quandl-3.6.1 inflection-0.5.1

In [20]:
import quandl

In [21]:
sunspots = quandl.get("SIDC/SUNSPOTS_A")
sunspots.head()

,Yearly Mean Total Sunspot Number,Yearly Mean Standard Deviation,Number of Observations,Definitive/Provisional Indicator
Date,,,,
1700-12-31,8.3,NaN,NaN,1.0
1701-12-31,18.3,NaN,NaN,1.0
1702-12-31,26.7,NaN,NaN,1.0
1703-12-31,38.3,NaN,NaN,1.0
1704-12-31,60.0,NaN,NaN,1.0

In [22]:
sunspots.tail()

,Yearly Mean Total Sunspot Number,Yearly Mean Standard Deviation,Number of Observations,Definitive/Provisional Indicator
Date,,,,
2016-12-31,39.8,3.9,9940.0,1.0
2017-12-31,21.7,2.5,11444.0,1.0
2018-12-31,7.0,1.1,12611.0,1.0
2019-12-31,3.6,0.5,12884.0,1.0
2020-12-31,8.8,4.1,14440.0,1.0

In [23]:
sunspots_filtered = sunspots[['Yearly Mean Standard Deviation','Yearly Mean Total Sunspot Number']]
sunspots_filtered.head()

            Yearly Mean Standard Deviation  Yearly Mean Total Sunspot Number
Date
1700-12-31                             NaN                               8.3
1701-12-31                             NaN                              18.3
1702-12-31                             NaN                              26.7
1703-12-31                             NaN                              38.3
1704-12-31                             NaN                              60.0

In [24]:
sunspots["20020101": "20131231"]

,Yearly Mean Total Sunspot Number,Yearly Mean Standard Deviation,Number of Observations,Definitive/Provisional Indicator
Date,,,,
2002-12-31,163.6,9.8,6588.0,1.0
2003-12-31,99.3,7.1,7087.0,1.0
2004-12-31,65.3,5.9,6882.0,1.0
2005-12-31,45.8,4.7,7084.0,1.0
2006-12-31,24.7,3.5,6370.0,1.0
2007-12-31,12.6,2.7,6841.0,1.0
2008-12-31,4.2,2.5,6644.0,1.0
2009-12-31,4.8,2.5,6465.0,1.0
2010-12-31,24.9,3.4,6328.0,1.0
2011-12-31,80.8,6.7,6077.0,1.0
2012-12-31,84.5,6.7,5753.0,1.0
2013-12-31,94.0,6.9,5347.0,1.0

In [26]:
sunspots[sunspots['Yearly Mean Total Sunspot Number'] > sunspots['Yearly Mean Total Sunspot Number'].mean()].head()

,Yearly Mean Total Sunspot Number,Yearly Mean Standard Deviation,Number of Observations,Definitive/Provisional Indicator
Date,,,,
1705-12-31,96.7,NaN,NaN,1.0
1717-12-31,105.0,NaN,NaN,1.0
1718-12-31,100.0,NaN,NaN,1.0
1726-12-31,130.0,NaN,NaN,1.0
1727-12-31,203.3,NaN,NaN,1.0

In [28]:
df.describe()

,CountryID,Continent,Adolescent fertility rate (%),Adult literacy rate (%),Gross national income per capita (PPP international $),Net primary school enrolment ratio female (%),Net primary school enrolment ratio male (%),Population (in thousands) total
count,202.000000,202.000000,177.000000,131.000000,178.000000,179.000000,179.000000,1.890000e+02
mean,101.500000,3.579208,59.457627,78.871756,11250.112360,84.033520,85.698324,3.409964e+04
std,58.456537,1.808263,49.105286,20.415760,12586.753417,17.788047,15.451212,1.318377e+05
min,1.000000,1.000000,0.000000,23.600000,260.000000,6.000000,11.000000,2.000000e+00
25%,51.250000,2.000000,19.000000,68.400000,2112.500000,79.000000,79.500000,1.328000e+03
50%,101.500000,3.000000,46.000000,86.500000,6175.000000,90.000000,90.000000,6.640000e+03
75%,151.750000,5.000000,91.000000,95.300000,14502.500000,96.000000,96.000000,2.097100e+04
max,202.000000,7.000000,199.000000,99.800000,60870.000000,100.000000,100.000000,1.328474e+06

In [29]:
df.count()

Country                                                   202
CountryID                                                 202
Continent                                                 202
Adolescent fertility rate (%)                             177
Adult literacy rate (%)                                   131
Gross national income per capita (PPP international $)    178
Net primary school enrolment ratio female (%)             179
Net primary school enrolment ratio male (%)               179
Population (in thousands) total                           189
dtype: int64

In [30]:
df.median()

CountryID                                                  101.5
Continent                                                    3.0
Adolescent fertility rate (%)                               46.0
Adult literacy rate (%)                                     86.5
Gross national income per capita (PPP international $)    6175.0
Net primary school enrolment ratio female (%)               90.0
Net primary school enrolment ratio male (%)                 90.0
Population (in thousands) total                           6640.0
dtype: float64

In [31]:
df.std()

CountryID                                                     58.456537
Continent                                                      1.808263
Adolescent fertility rate (%)                                 49.105286
Adult literacy rate (%)                                       20.415760
Gross national income per capita (PPP international $)     12586.753417
Net primary school enrolment ratio female (%)                 17.788047
Net primary school enrolment ratio male (%)                   15.451212
Population (in thousands) total                           131837.708677
dtype: float64

In [32]:
df.groupby('Continent').mean()

,CountryID,Adolescent fertility rate (%),Adult literacy rate (%),Gross national income per capita (PPP international $),Net primary school enrolment ratio female (%),Net primary school enrolment ratio male (%),Population (in thousands) total
Continent,,,,,,,
1,110.238095,37.300000,76.900000,14893.529412,85.789474,88.315789,16843.350000
2,100.333333,20.500000,97.911538,19777.083333,92.911111,93.088889,17259.627451
3,99.354167,111.644444,61.690476,3050.434783,67.574468,72.021277,16503.195652
4,56.285714,49.600000,91.600000,24524.000000,95.000000,94.400000,73577.333333
5,94.774194,77.888889,87.940909,7397.142857,89.137931,88.517241,15637.241379
6,121.228571,39.260870,87.607143,12167.200000,89.040000,89.960000,25517.142857
7,80.777778,57.333333,69.812500,2865.555556,85.444444,88.888889,317683.666667

In [33]:
dest = pd.read_csv('dest.csv')
dest.head()

   EmpNr       Dest
0      5  The Hague
1      3  Amsterdam
2      9  Rotterdam

In [34]:
tips = pd.read_csv('tips.csv')
tips.head()

   EmpNr  Amount
0      5    10.0
1      9     5.0
2      7     2.5

In [35]:
# Inner join

df_inner = pd.merge(dest, tips, on='EmpNr', how='inner')
df_inner.head()

   EmpNr       Dest  Amount
0      5  The Hague    10.0
1      9  Rotterdam     5.0

In [36]:
# Full outer join

df_outer = pd.merge(dest, tips, on='EmpNr', how='outer')
df_outer.head()

   EmpNr       Dest  Amount
0      5  The Hague    10.0
1      3  Amsterdam     NaN
2      9  Rotterdam     5.0
3      7        NaN     2.5

In [37]:
# Right outer join

df_right = pd.merge(dest, tips, on='EmpNr', how='right')
df_right.head()

   EmpNr       Dest  Amount
0      5  The Hague    10.0
1      9  Rotterdam     5.0
2      7        NaN     2.5

In [38]:
# Left outer join

df_left = pd.merge(dest, tips, on='EmpNr', how='left')
df_left.head()

   EmpNr       Dest  Amount
0      5  The Hague    10.0
1      3  Amsterdam     NaN
2      9  Rotterdam     5.0

In [39]:
# Missing values

df.isnull().sum()

Country                                                    0
CountryID                                                  0
Continent                                                  0
Adolescent fertility rate (%)                             25
Adult literacy rate (%)                                   71
Gross national income per capita (PPP international $)    24
Net primary school enrolment ratio female (%)             23
Net primary school enrolment ratio male (%)               23
Population (in thousands) total                           13
dtype: int64

In [40]:
df.dropna(inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 118 entries, 1 to 200
Data columns (total 9 columns):
 #   Column                                                  Non-Null Count  Dtype
---  ------                                                  --------------  -----
 0   Country                                                 118 non-null    object
 1   CountryID                                               118 non-null    int64
 2   Continent                                               118 non-null    int64
 3   Adolescent fertility rate (%)                           118 non-null    float64
 4   Adult literacy rate (%)                                 118 non-null    float64
 5   Gross national income per capita (PPP international $)  118 non-null    float64
 6   Net primary school enrolment ratio female (%)           118 non-null    float64
 7   Net primary school enrolment ratio male (%)             118 non-null    float64
 8   Population (in thousands) total                         118 non-null    float64
dtypes: float64(6), int64(2), object(1)
memory usage: 9.2+ KB

In [42]:
df = pd.read_csv('WHO_first9cols.csv')
df.head()

,Country,CountryID,Continent,Adolescent fertility rate (%),Adult literacy rate (%),Gross national income per capita (PPP international $),Net primary school enrolment ratio female (%),Net primary school enrolment ratio male (%),Population (in thousands) total
0,Afghanistan,1,1,151.0,28.0,NaN,NaN,NaN,26088.0
1,Albania,2,2,27.0,98.7,6000.0,93.0,94.0,3172.0
2,Algeria,3,3,6.0,69.9,5940.0,94.0,96.0,33351.0
3,Andorra,4,2,NaN,NaN,NaN,83.0,83.0,74.0
4,Angola,5,3,146.0,67.4,3890.0,49.0,51.0,16557.0

In [43]:
df.fillna(0, inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 202 entries, 0 to 201
Data columns (total 9 columns):
 #   Column                                                  Non-Null Count  Dtype
---  ------                                                  --------------  -----
 0   Country                                                 202 non-null    object
 1   CountryID                                               202 non-null    int64
 2   Continent                                               202 non-null    int64
 3   Adolescent fertility rate (%)                           202 non-null    float64
 4   Adult literacy rate (%)                                 202 non-null    float64
 5   Gross national income per capita (PPP international $)  202 non-null    float64
 6   Net primary school enrolment ratio female (%)           202 non-null    float64
 7   Net primary school enrolment ratio male (%)             202 non-null    float64
 8   Population (in thousands) total                         202 non-null    float64
dtypes: float64(6), int64(2), object(1)
memory usage: 14.3+ KB

In [44]:
purchase = pd.read_csv('purchase.csv')
purchase.head()

  Weather       Food     Price  Number
0    cold       soup  3.745401       8
1     hot       soup  9.507143       8
2    cold   icecream  7.319939       8
3     hot  chocolate  5.986585       8
4    cold   icecream  1.560186       8

In [45]:
pd.pivot_table(purchase, values='Number', index=['Weather',], columns=['Food'], aggfunc=np.sum)

Food     chocolate  icecream  soup
Weather
cold           NaN      16.0  16.0
hot            8.0       8.0   8.0

In [46]:
pd.date_range('01-01-2000', periods=45, freq='D')

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08',
               '2000-01-09', '2000-01-10', '2000-01-11', '2000-01-12',
               '2000-01-13', '2000-01-14', '2000-01-15', '2000-01-16',
               '2000-01-17', '2000-01-18', '2000-01-19', '2000-01-20',
               '2000-01-21', '2000-01-22', '2000-01-23', '2000-01-24',
               '2000-01-25', '2000-01-26', '2000-01-27', '2000-01-28',
               '2000-01-29', '2000-01-30', '2000-01-31', '2000-02-01',
               '2000-02-02', '2000-02-03', '2000-02-04', '2000-02-05',
               '2000-02-06', '2000-02-07', '2000-02-08', '2000-02-09',
               '2000-02-10', '2000-02-11', '2000-02-12', '2000-02-13',
               '2000-02-14'],
              dtype='datetime64[ns]', freq='D')

In [47]:
pd.to_datetime('1/1/2020')

Timestamp('2020-01-01 00:00:00')

In [48]:
pd.to_datetime(['20200101', '20200102'], format='%Y%m%d')

DatetimeIndex(['2020-01-01', '2020-01-02'], dtype='datetime64[ns]', freq=None)

In [49]:
pd.to_datetime(['20200101', "Not a datetime"])

ParserError: Unknown string format: Not a datetime

In [50]:
# To fix this error we do

pd.to_datetime(['20200101', 'Not a date'], errors='coerce')

DatetimeIndex(['2020-01-01', 'NaT'], dtype='datetime64[ns]', freq=None)